rheoTool/tutorials/rheoEFoam/EEI/PoissonBoltzmann/CrossSlot/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{

    inlet_top
    {
       type             pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    
    inlet_down
    {
      type              pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    walls
    {
        type            noSlip;
        value           uniform (0 0 0);
    }

    outlet_left
    {
         type           pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    outlet_right
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    
    "(top|base)"
    {
        type            empty;
    }
}

// ************************************************************************* //
